       01  WRK-DATE.
           05 WRK-DAY      PIC 9(02) VALUE ZEROS.
           05 WRK-MONTH    PIC X(09) VALUE SPACES.
           05 WRK-YEAR     PIC 9(04) VALUE ZEROS.
