       77  WRK-FIRST-NUM   PIC 9(5)V99  COMP-3 VALUE ZEROS.
       77  WRK-SECOND-NUM  PIC 9(5)V99  COMP-3 VALUE ZEROS.
       77  WRK-TOTAL-NUM   PIC 9(10)V99        VALUE ZEROS.
