       IDENTIFICATION                  DIVISION.
       PROGRAM-ID.ADDING.
      *=================================================================
      *    AUTHOR:  NATAN BOANAFINA
      *    DATE:    07-11-2022
      *    PURPOSE: SUM LOGIC.
      *=================================================================
       ENVIRONMENT                     DIVISION.
       CONFIGURATION                   SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA                            DIVISION.
       WORKING-STORAGE                 SECTION.
       PROCEDURE                       DIVISION.
